### Reading Data From Different Sources

In [2]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [3]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [4]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [5]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [6]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [7]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [8]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [ ]:
df.to_csv("wine.csv")

In [9]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (5.3.1)

In [10]:
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: html5lib in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\pmls\appdata\roaming\python\python312\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: beautifulsoup4 in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (4.13.3)
Requirement already satisfied: soupsieve>1.2 in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (from beautifulsoup4) (2.6)
Requirement already satisfied: typing-extensions>=4.0.0 in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (from beautifulsoup4) (4.12.2)

In [13]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df=pd.read_html(url)

In [14]:
df

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                Acquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [17]:
df[0]['Bank Name']

0                     Pulaski Savings Bank
1       The First National Bank of Lindsay
2    Republic First Bank dba Republic Bank
3                            Citizens Bank
4                 Heartland Tri-State Bank
5                      First Republic Bank
6                           Signature Bank
7                      Silicon Valley Bank
8                        Almena State Bank
9               First City Bank of Florida
Name: Bank Name, dtype: object

In [20]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
df=pd.read_html(url,match="Country",header=0)[0]

In [21]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\pmls\desktop\internship_2025\day-1\venv\venv\lib\site-packages (from openpyxl) (2.0.0)

In [22]:
df_excel=pd.read_excel('correlation.xlsx')
df_excel.head()

  Protocol  DNA Yield    A260    A280  260/280  260/230
0        A     548.76  27.437  15.230     1.80     1.95
1        A     291.92  14.595   7.877     1.85     2.11
2        A     299.68  14.984   7.965     1.88     2.00
3        A     367.76  18.387   9.820     1.87     2.00
4        A     363.56  18.179   9.749     1.86     1.98

In [23]:
df_excel.to_pickle('df_excel')

In [24]:
pd.read_pickle('df_excel').head()

  Protocol  DNA Yield    A260    A280  260/280  260/230
0        A     548.76  27.437  15.230     1.80     1.95
1        A     291.92  14.595   7.877     1.85     2.11
2        A     299.68  14.984   7.965     1.88     2.00
3        A     367.76  18.387   9.820     1.87     2.00
4        A     363.56  18.179   9.749     1.86     1.98